# Core
brew "git"
brew "gh"

# Terminal UI
brew "lazygit"
brew "tig"
brew "fzf"
brew "tmux"

# Better defaults
brew "bat"      # better cat
brew "fd"       # better find
brew "ripgrep"  # better grep
brew "git-delta"
brew "eza"      # better ls (exa replacement)
brew "zoxide"   # smarter cd

# Development
brew "node"
brew "fnm"      # fast node version manager

# System Monitoring
brew "btop"     # better top/htop
brew "duf"      # better df (disk usage)
brew "gping"    # ping with graph

# Optional: starship prompt (uncomment if using)
# brew "starship"
